ycsb_logs_hugepage/run.log
./test/benchmark/jre/jre1.8.0_471//bin/java  -classpath /root/asterinas/ycsb-0.17.0/conf:/root/asterinas/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/root/asterinas/ycsb-0.17.0/lib/core-0.17.0.jar:/root/asterinas/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/commons-pool2-2.4.2.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/jedis-2.9.0.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15
[OVERALL], RunTime(ms), 2811
[OVERALL], Throughput(ops/sec), 35574.528637495554
[TOTAL_GCS_PS_Scavenge], Count, 7
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 14
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.4980434009249377
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 7
[TOTAL_GC_TIME], Time(ms), 14
[TOTAL_GC_TIME_%], Time(%), 0.4980434009249377
[READ], Operations, 5003
[READ], AverageLatency(us), 25.073355986408156
[READ], MinLatency(us), 12
[READ], MaxLatency(us), 2435
[READ], 95thPercentileLatency(us), 42
[READ], 99thPercentileLatency(us), 53
[READ], Return=OK, 5003
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 280.0
[CLEANUP], MinLatency(us), 280
[CLEANUP], MaxLatency(us), 280
[CLEANUP], 95thPercentileLatency(us), 280
[CLEANUP], 99thPercentileLatency(us), 280
[UPDATE], Operations, 94997
[UPDATE], AverageLatency(us), 27.131625209217134
[UPDATE], MinLatency(us), 11
[UPDATE], MaxLatency(us), 2813
[UPDATE], 95thPercentileLatency(us), 49
[UPDATE], 99thPercentileLatency(us), 70
[UPDATE], Return=OK, 94997
./test/benchmark/jre/jre1.8.0_471//bin/java  -classpath /root/asterinas/ycsb-0.17.0/conf:/root/asterinas/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/root/asterinas/ycsb-0.17.0/lib/core-0.17.0.jar:/root/asterinas/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/commons-pool2-2.4.2.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/jedis-2.9.0.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15
[OVERALL], RunTime(ms), 2603
[OVERALL], Throughput(ops/sec), 38417.2109104879
[TOTAL_GCS_PS_Scavenge], Count, 7
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 16
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.6146753745678064
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 7
[TOTAL_GC_TIME], Time(ms), 16
[TOTAL_GC_TIME_%], Time(%), 0.6146753745678064
[READ], Operations, 5129
[READ], AverageLatency(us), 24.092805615129656
[READ], MinLatency(us), 12
[READ], MaxLatency(us), 2621
[READ], 95thPercentileLatency(us), 31
[READ], 99thPercentileLatency(us), 44
[READ], Return=OK, 5129
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 283.0
[CLEANUP], MinLatency(us), 283
[CLEANUP], MaxLatency(us), 283
[CLEANUP], 95thPercentileLatency(us), 283
[CLEANUP], 99thPercentileLatency(us), 283
[UPDATE], Operations, 94871
[UPDATE], AverageLatency(us), 25.140717395199797
[UPDATE], MinLatency(us), 12
[UPDATE], MaxLatency(us), 3075
[UPDATE], 95thPercentileLatency(us), 39
[UPDATE], 99thPercentileLatency(us), 52
[UPDATE], Return=OK, 94871
./test/benchmark/jre/jre1.8.0_471//bin/java  -classpath /root/asterinas/ycsb-0.17.0/conf:/root/asterinas/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/root/asterinas/ycsb-0.17.0/lib/core-0.17.0.jar:/root/asterinas/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/commons-pool2-2.4.2.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/jedis-2.9.0.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15
[OVERALL], RunTime(ms), 2634
[OVERALL], Throughput(ops/sec), 37965.072133637055
[TOTAL_GCS_PS_Scavenge], Count, 7
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 15
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.5694760820045558
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 7
[TOTAL_GC_TIME], Time(ms), 15
[TOTAL_GC_TIME_%], Time(%), 0.5694760820045558
[READ], Operations, 4997
[READ], AverageLatency(us), 23.20472283370022
[READ], MinLatency(us), 13
[READ], MaxLatency(us), 1695
[READ], 95thPercentileLatency(us), 37
[READ], 99thPercentileLatency(us), 52
[READ], Return=OK, 4997
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 295.0
[CLEANUP], MinLatency(us), 295
[CLEANUP], MaxLatency(us), 295
[CLEANUP], 95thPercentileLatency(us), 295
[CLEANUP], 99thPercentileLatency(us), 295
[UPDATE], Operations, 95003
[UPDATE], AverageLatency(us), 25.479605907181877
[UPDATE], MinLatency(us), 11
[UPDATE], MaxLatency(us), 3045
[UPDATE], 95thPercentileLatency(us), 43
[UPDATE], 99thPercentileLatency(us), 67
[UPDATE], Return=OK, 95003
./test/benchmark/jre/jre1.8.0_471//bin/java  -classpath /root/asterinas/ycsb-0.17.0/conf:/root/asterinas/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/root/asterinas/ycsb-0.17.0/lib/core-0.17.0.jar:/root/asterinas/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/commons-pool2-2.4.2.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/jedis-2.9.0.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15
[OVERALL], RunTime(ms), 2770
[OVERALL], Throughput(ops/sec), 36101.08303249098
[TOTAL_GCS_PS_Scavenge], Count, 7
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 14
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.5054151624548736
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 7
[TOTAL_GC_TIME], Time(ms), 14
[TOTAL_GC_TIME_%], Time(%), 0.5054151624548736
[READ], Operations, 5105
[READ], AverageLatency(us), 24.795494613124387
[READ], MinLatency(us), 12
[READ], MaxLatency(us), 2863
[READ], 95thPercentileLatency(us), 39
[READ], 99thPercentileLatency(us), 53
[READ], Return=OK, 5105
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 294.0
[CLEANUP], MinLatency(us), 294
[CLEANUP], MaxLatency(us), 294
[CLEANUP], 95thPercentileLatency(us), 294
[CLEANUP], 99thPercentileLatency(us), 294
[UPDATE], Operations, 94895
[UPDATE], AverageLatency(us), 26.72755150429422
[UPDATE], MinLatency(us), 12
[UPDATE], MaxLatency(us), 3451
[UPDATE], 95thPercentileLatency(us), 46
[UPDATE], 99thPercentileLatency(us), 68
[UPDATE], Return=OK, 94895
./test/benchmark/jre/jre1.8.0_471//bin/java  -classpath /root/asterinas/ycsb-0.17.0/conf:/root/asterinas/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/root/asterinas/ycsb-0.17.0/lib/core-0.17.0.jar:/root/asterinas/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/commons-pool2-2.4.2.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/jedis-2.9.0.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15
[OVERALL], RunTime(ms), 2570
[OVERALL], Throughput(ops/sec), 38910.505836575874
[TOTAL_GCS_PS_Scavenge], Count, 7
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 16
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.622568093385214
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 7
[TOTAL_GC_TIME], Time(ms), 16
[TOTAL_GC_TIME_%], Time(%), 0.622568093385214
[READ], Operations, 4871
[READ], AverageLatency(us), 22.885649763908848
[READ], MinLatency(us), 12
[READ], MaxLatency(us), 2569
[READ], 95thPercentileLatency(us), 30
[READ], 99thPercentileLatency(us), 42
[READ], Return=OK, 4871
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 285.0
[CLEANUP], MinLatency(us), 285
[CLEANUP], MaxLatency(us), 285
[CLEANUP], 95thPercentileLatency(us), 285
[CLEANUP], 99thPercentileLatency(us), 285
[UPDATE], Operations, 95129
[UPDATE], AverageLatency(us), 24.827770711349853
[UPDATE], MinLatency(us), 12
[UPDATE], MaxLatency(us), 3399
[UPDATE], 95thPercentileLatency(us), 38
[UPDATE], 99thPercentileLatency(us), 50
[UPDATE], Return=OK, 95129
./test/benchmark/jre/jre1.8.0_471//bin/java  -classpath /root/asterinas/ycsb-0.17.0/conf:/root/asterinas/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/root/asterinas/ycsb-0.17.0/lib/core-0.17.0.jar:/root/asterinas/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/commons-pool2-2.4.2.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/jedis-2.9.0.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15
[OVERALL], RunTime(ms), 2594
[OVERALL], Throughput(ops/sec), 38550.501156515034
[TOTAL_GCS_PS_Scavenge], Count, 7
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 15
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.5782575173477255
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 7
[TOTAL_GC_TIME], Time(ms), 15
[TOTAL_GC_TIME_%], Time(%), 0.5782575173477255
[READ], Operations, 5016
[READ], AverageLatency(us), 23.033891547049443
[READ], MinLatency(us), 13
[READ], MaxLatency(us), 1534
[READ], 95thPercentileLatency(us), 32
[READ], 99thPercentileLatency(us), 41
[READ], Return=OK, 5016
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 287.0
[CLEANUP], MinLatency(us), 287
[CLEANUP], MaxLatency(us), 287
[CLEANUP], 95thPercentileLatency(us), 287
[CLEANUP], 99thPercentileLatency(us), 287
[UPDATE], Operations, 94984
[UPDATE], AverageLatency(us), 25.115619472753306
[UPDATE], MinLatency(us), 11
[UPDATE], MaxLatency(us), 3163
[UPDATE], 95thPercentileLatency(us), 39
[UPDATE], 99thPercentileLatency(us), 49
[UPDATE], Return=OK, 94984
./test/benchmark/jre/jre1.8.0_471//bin/java  -classpath /root/asterinas/ycsb-0.17.0/conf:/root/asterinas/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/root/asterinas/ycsb-0.17.0/lib/core-0.17.0.jar:/root/asterinas/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/commons-pool2-2.4.2.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/jedis-2.9.0.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15
[OVERALL], RunTime(ms), 2697
[OVERALL], Throughput(ops/sec), 37078.23507601038
[TOTAL_GCS_PS_Scavenge], Count, 7
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 17
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.6303299962921765
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 7
[TOTAL_GC_TIME], Time(ms), 17
[TOTAL_GC_TIME_%], Time(%), 0.6303299962921765
[READ], Operations, 5014
[READ], AverageLatency(us), 23.765656162744317
[READ], MinLatency(us), 12
[READ], MaxLatency(us), 2601
[READ], 95thPercentileLatency(us), 36
[READ], 99thPercentileLatency(us), 49
[READ], Return=OK, 5014
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 284.0
[CLEANUP], MinLatency(us), 284
[CLEANUP], MaxLatency(us), 284
[CLEANUP], 95thPercentileLatency(us), 284
[CLEANUP], 99thPercentileLatency(us), 284
[UPDATE], Operations, 94986
[UPDATE], AverageLatency(us), 26.060661571178912
[UPDATE], MinLatency(us), 12
[UPDATE], MaxLatency(us), 3171
[UPDATE], 95thPercentileLatency(us), 43
[UPDATE], 99thPercentileLatency(us), 63
[UPDATE], Return=OK, 94986
./test/benchmark/jre/jre1.8.0_471//bin/java  -classpath /root/asterinas/ycsb-0.17.0/conf:/root/asterinas/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/root/asterinas/ycsb-0.17.0/lib/core-0.17.0.jar:/root/asterinas/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/commons-pool2-2.4.2.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/jedis-2.9.0.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15
[OVERALL], RunTime(ms), 2758
[OVERALL], Throughput(ops/sec), 36258.15808556925
[TOTAL_GCS_PS_Scavenge], Count, 7
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 18
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.6526468455402465
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 7
[TOTAL_GC_TIME], Time(ms), 18
[TOTAL_GC_TIME_%], Time(%), 0.6526468455402465
[READ], Operations, 4959
[READ], AverageLatency(us), 24.40290381125227
[READ], MinLatency(us), 12
[READ], MaxLatency(us), 2601
[READ], 95thPercentileLatency(us), 41
[READ], 99thPercentileLatency(us), 54
[READ], Return=OK, 4959
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 296.0
[CLEANUP], MinLatency(us), 296
[CLEANUP], MaxLatency(us), 296
[CLEANUP], 95thPercentileLatency(us), 296
[CLEANUP], 99thPercentileLatency(us), 296
[UPDATE], Operations, 95041
[UPDATE], AverageLatency(us), 26.653928304626426
[UPDATE], MinLatency(us), 12
[UPDATE], MaxLatency(us), 4067
[UPDATE], 95thPercentileLatency(us), 49
[UPDATE], 99thPercentileLatency(us), 70
[UPDATE], Return=OK, 95041
./test/benchmark/jre/jre1.8.0_471//bin/java  -classpath /root/asterinas/ycsb-0.17.0/conf:/root/asterinas/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/root/asterinas/ycsb-0.17.0/lib/core-0.17.0.jar:/root/asterinas/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/commons-pool2-2.4.2.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/jedis-2.9.0.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15
[OVERALL], RunTime(ms), 2607
[OVERALL], Throughput(ops/sec), 38358.26620636747
[TOTAL_GCS_PS_Scavenge], Count, 7
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 16
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.6137322593018796
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 7
[TOTAL_GC_TIME], Time(ms), 16
[TOTAL_GC_TIME_%], Time(%), 0.6137322593018796
[READ], Operations, 4976
[READ], AverageLatency(us), 22.832395498392284
[READ], MinLatency(us), 12
[READ], MaxLatency(us), 1722
[READ], 95thPercentileLatency(us), 30
[READ], 99thPercentileLatency(us), 50
[READ], Return=OK, 4976
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 296.0
[CLEANUP], MinLatency(us), 296
[CLEANUP], MaxLatency(us), 296
[CLEANUP], 95thPercentileLatency(us), 296
[CLEANUP], 99thPercentileLatency(us), 296
[UPDATE], Operations, 95024
[UPDATE], AverageLatency(us), 25.21460894089914
[UPDATE], MinLatency(us), 11
[UPDATE], MaxLatency(us), 3455
[UPDATE], 95thPercentileLatency(us), 39
[UPDATE], 99thPercentileLatency(us), 64
[UPDATE], Return=OK, 95024